{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/sokbaelee/Dropbox/Github/persuasio-stata/persuasio_example.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Nov 2022, 13:31:12
{txt}
{com}. ************************************************
. **** Examples for Stata module "persuasio" *****
. ************************************************
. 
. * Data summary
. 
. use GKB_persuasio, clear
{txt}
{com}. by post, sort: tab voteddem_all readsome

{txt}{hline}
-> post = 0

 Voted for {c |}
  Democrat {c |}
   in 2005 {c |}
       Gub {c |}
 election, {c |} Reads paper at least
  set to 0 {c |}   several times per
if did not {c |}         week
      vote {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       162        130 {txt}{c |}{res}       292 
{txt}         1 {c |}{res}        46         77 {txt}{c |}{res}       123 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       208        207 {txt}{c |}{res}       415 

{txt}{hline}
-> post = 1

 Voted for {c |}
  Democrat {c |}
   in 2005 {c |}
       Gub {c |}
 election, {c |} Reads paper at least
  set to 0 {c |}   several times per
if did not {c |}         week
      vote {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}        94         93 {txt}{c |}{res}       187 
{txt}         1 {c |}{res}        31         68 {txt}{c |}{res}        99 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       125        161 {txt}{c |}{res}       286 

{txt}
{com}. 
. *************************************
. **** Examples without Covariates ****
. *************************************
. 
. * The first example conducts inference on APR when y,t,z are observed.
. 
. persuasio apr voteddem_all readsome post, level(80) method("normal")
 
{txt}{hline 65}
{bf:persuasio4ytz:} Causal inference on the Average Persuasion Rate
 when outcome, instrument and instrument are observed
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Bound Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
 Average Persuasion Rate {c |}{res}{col 27} .070732 {col 33} .634288 {col 47}  .02881 {col 53} .661059 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on normal approximation
       using the method of Stoye (2009).                      
       Conf. interval is missing if covariates are present.
       Use option bootstrap for that case.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. 
. set seed 339487731
{txt}
{com}. persuasio apr voteddem_all readsome post, ///
>         level(80) method("bootstrap") nboot(100)
 
{txt}{hline 65}
{bf:persuasio4ytz:} Causal inference on the Average Persuasion Rate
 when outcome, instrument and instrument are observed
 along with covariates
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 - Covariates (if exist): 
 - Regression model (if specified): 
 
{res}{txt}(running {bf:aprlb} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:aprlb voteddem_all post, model("") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(lb_coef)}{p_end}
{res}{txt}(running {bf:aprub} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:aprub voteddem_all readsome post, model("") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(ub_coef)}{p_end}
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Bound Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
 Average Persuasion Rate {c |}{res}{col 27} .070732 {col 33} .634288 {col 47} .023039 {col 53} .657453 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on percentile bootstrap.
     The conf. level is one-sided for the lower and upper bounds separately.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}.         
. * The second example conducts inference on LPR when y,t,z are observed.
.                 
. persuasio lpr voteddem_all readsome post, level(80) method("normal") 
 
{txt}{hline 65}
{bf:persuasio4ytz2lpr:} Causal inference on the local Persuasion rate
 when outcome, instrument and instrument are observed
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 - Covariates (if exist): 
 - Regression model (if specified): 
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
   Local Persuasion Rate {c |}{res}{col 27} .806747 {col 47} .124333 {col 53}       1 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on normal approximation.
   Conf. interval is missing (given as [0,1])  if interactions are
   allowed between x and z. Use option bootstrap for that case.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. 
. * The third example conducts inference on APR and LPR when y,z are observed only.               
. 
. persuasio yz voteddem_all post, level(80) method("normal")
 
{txt}{hline 65}
{bf:persuasio4yz:} Causal inference on the average persuasion rate
 when binary outcomes and binary instruments are observed
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary instrument: post
 
{hline 13}{c TT}{hline 40}
   Parameter {c |}{col 16} Estimate {col 30}[80% Conf. Interval]
{hline 13}{c +}{hline 40}
 Lower Bound {c |}{res}{col 17} .070732 {col 32} .028802        1 
{txt}{hline 13}{c BT}{hline 40}
 
Note: 80% one-sided conf. interval is based on normal approximation.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. 
. * The fourth example considers the case when we have summary statistics on Pr(y=1|z) and/or Pr(t=1|z).
. 
. foreach var in voteddem_all readsome {c -(} 
{txt}  2{com}.         foreach treat in 0 1 {c -(}
{txt}  3{com}.                 qui sum `var' if post == `treat'
{txt}  4{com}.                 scalar `var'_`treat' = r(mean)
{txt}  5{com}.         {c )-}
{txt}  6{com}. {c )-}
{txt}
{com}. persuasio calc voteddem_all_1 voteddem_all_0 readsome_1 readsome_0
 
{txt}{hline 62}
{bf:calc4persuasio:} Calculate the effect of persuasion when info.
   on Pr(y=1|z) and/or Pr(t=1|z) for each z=0,1 is available
 
{hline 25}{c TT}{hline 37}
               Parameter {c |}{col 26} Lower Bound {col 45} Upper Bound 
{hline 25}{c +}{hline 37}
 Average Persuasion Rate {c |}{res}{col 28} .070732 {col 47} .783217 
   {txt}Local Persuasion Rate {c |}{res}{col 28}  .77591 {col 47}       1 
{txt}{hline 25}{c BT}{hline 37}


{com}. 
. persuasio calc voteddem_all_1 voteddem_all_0
 
{txt}{hline 62}
{bf:calc4persuasio:} Calculate the effect of persuasion when info.
   on Pr(y=1|z) and/or Pr(t=1|z) for each z=0,1 is available
 
{hline 25}{c TT}{hline 37}
               Parameter {c |}{col 26} Lower Bound {col 45} Upper Bound 
{hline 25}{c +}{hline 37}
 Average Persuasion Rate {c |}{res}{col 28} .070732 {col 47}       1 
   {txt}Local Persuasion Rate {c |}{res}{col 28} .070732 {col 47}       1 
{txt}{hline 25}{c BT}{hline 37}
 
Note: Exposure rates, Pr(t=1|z) for z=0,1, are missing.
 

{com}. 
. 
. *************************************
. **** Examples with Covariates    ****
. *************************************
. 
. * The first example conducts inference on APR when y,t,z are observed along with x.
. 
. persuasio apr voteddem_all readsome post MZwave2
 
{txt}{hline 65}
{bf:persuasio4ytz:} Causal inference on the Average Persuasion Rate
 when outcome, instrument and instrument are observed
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Bound Estimate{col 48}95% Conf. Interval
{hline 25}{c +}{hline 40}
 Average Persuasion Rate {c |}{res}{col 27}  .07193 {col 33} .635677 {col 47}       . {col 53}       . 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 95% conf. interval is based on normal approximation
       using the method of Stoye (2009).                      
       Conf. interval is missing if covariates are present.
       Use option bootstrap for that case.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. 
. set seed 339487731
{txt}
{com}. persuasio apr voteddem_all readsome post MZwave2, ///
>         level(80) method("bootstrap") nboot(100)
 
{txt}{hline 65}
{bf:persuasio4ytz:} Causal inference on the Average Persuasion Rate
 when outcome, instrument and instrument are observed
 along with covariates
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 - Covariates (if exist): MZwave2
 - Regression model (if specified): 
 
{res}{txt}(running {bf:aprlb} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:aprlb voteddem_all post MZwave2, model("") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(lb_coef)}{p_end}
{res}{txt}(running {bf:aprub} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:aprub voteddem_all readsome post MZwave2, model("") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(ub_coef)}{p_end}
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Bound Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
 Average Persuasion Rate {c |}{res}{col 27}  .07193 {col 33} .635677 {col 47} .023165 {col 53} .659189 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on percentile bootstrap.
     The conf. level is one-sided for the lower and upper bounds separately.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. * display estimation results
. mat list e(apr_est)     
{res}
{txt}e(apr_est)[1,2]
           c1         c2
r1 {res} .07193046  .63567656
{reset}
{com}. mat list e(apr_ci)      
{res}
{txt}e(apr_ci)[1,2]
           c1         c2
r1 {res} .02316534  .65918896
{reset}
{com}. persuasio apr voteddem_all readsome post MZwave2, ///
>         level(80) model("interaction") method("bootstrap") nboot(100)
 
{txt}{hline 65}
{bf:persuasio4ytz:} Causal inference on the Average Persuasion Rate
 when outcome, instrument and instrument are observed
 along with covariates
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 - Covariates (if exist): MZwave2
 - Regression model (if specified): interaction
 
{res}{txt}(running {bf:aprlb} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:aprlb voteddem_all post MZwave2, model("interaction") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(lb_coef)}{p_end}
{res}{txt}(running {bf:aprub} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:aprub voteddem_all readsome post MZwave2, model("interaction") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(ub_coef)}{p_end}
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Bound Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
 Average Persuasion Rate {c |}{res}{col 27} .072479 {col 33} .637766 {col 47} .029776 {col 53} .664669 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on percentile bootstrap.
     The conf. level is one-sided for the lower and upper bounds separately.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. * display estimation results
. mat list e(apr_est)     
{res}
{txt}e(apr_est)[1,2]
           c1         c2
r1 {res} .07247888  .63776611
{reset}
{com}. mat list e(apr_ci)              
{res}
{txt}e(apr_ci)[1,2]
           c1         c2
r1 {res} .02977579  .66466922
{reset}
{com}. 
. * The second example conducts inference on APR and LPR when y,z are observed with a covariate, MZwave2.                 
. 
. persuasio lpr voteddem_all readsome post MZwave2, level(80) 
 
{txt}{hline 65}
{bf:persuasio4ytz2lpr:} Causal inference on the local Persuasion rate
 when outcome, instrument and instrument are observed
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 - Covariates (if exist): MZwave2
 - Regression model (if specified): 
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
   Local Persuasion Rate {c |}{res}{col 27} .831206 {col 47} .135306 {col 53}       1 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on normal approximation.
   Conf. interval is missing (given as [0,1])  if interactions are
   allowed between x and z. Use option bootstrap for that case.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. set seed 339487731      
{txt}
{com}. persuasio lpr voteddem_all readsome post MZwave2, ///
>         level(80) model("interaction") method("bootstrap") nboot(100)
 
{txt}{hline 65}
{bf:persuasio4ytz2lpr:} Causal inference on the local persuasion rate
 when outcome, instrument and instrument are observed
{hline 65}
 
 - Binary outcome: voteddem_all
 - Binary treatment: readsome
 - Binary instrument: post
 - Covariates (if exist): MZwave2
 - Regression model (if specified): interaction
 
{res}{txt}(running {bf:lpr4ytz} on estimation sample)

Bootstrap replications ({res}100{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
{res}
{txt}{col 1}Bootstrap results{col 60}{lalign 13:Number of obs}{col 73} = {res}{ralign 3:701}
{txt}{col 60}{lalign 13:Replications}{col 73} = {res}{ralign 3:100}
{p2colset 7 16 20 2}{...}

{txt}{p2col :Command:}{res:lpr4ytz voteddem_all readsome post MZwave2, model("interaction") }{p_end}
{p2colset 10 16 20 2}{...}
{p2col :coef:}{res:e(lpr_coef)}{p_end}
 
{hline 25}{c TT}{hline 40}
               Parameter {c |}{col 28}Estimate{col 48}80% Conf. Interval
{hline 25}{c +}{hline 40}
   Local Persuasion Rate {c |}{res}{col 27} .845333 {col 47}       0 {col 53}       1 
{txt}{hline 25}{c BT}{hline 40}
 
Note: 80% conf. interval is based on percentile bootstrap.
 
Reference: Jun and Lee (2022), arXiv:1812.02276 [econ.EM]

{com}. * display estimation results
. mat list e(lpr_est)     
{res}
{txt}symmetric e(lpr_est)[1,1]
           c1
r1 {res} .84533308
{reset}
{com}. mat list e(lpr_ci)                      
{res}
{txt}e(lpr_ci)[1,2]
    c1  c2
r1 {res}  0   1
{reset}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/sokbaelee/Dropbox/Github/persuasio-stata/persuasio_example.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}20 Nov 2022, 13:31:29
{txt}{.-}
{smcl}
{txt}{sf}{ul off}